Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCcu6_regdef.h
/** \brief Compare State Register */
typedef struct _Ifx_CCU6_CMPSTAT_Bits
{
    Ifx_UReg_32Bit CC6ST0:1;          /**< \brief [0:0] Capture/Compare State Bits for CC6${x} (x = 0, 1, 2) - CC6${x}ST (rh) */
    Ifx_UReg_32Bit CC6ST1:1;          /**< \brief [1:1] Capture/Compare State Bits for CC6${x} (x = 0, 1, 2) - CC6${x}ST (rh) */
    Ifx_UReg_32Bit CC6ST2:1;          /**< \brief [2:2] Capture/Compare State Bits for CC6${x} (x = 0, 1, 2) - CC6${x}ST (rh) */
    Ifx_UReg_32Bit CCPOS60:1;         /**< \brief [3:3] Sampled Hall Pattern Bits - CCPOS6${x} (rh) */
    Ifx_UReg_32Bit CCPOS61:1;         /**< \brief [4:4] Sampled Hall Pattern Bits - CCPOS6${x} (rh) */
    Ifx_UReg_32Bit CCPOS62:1;         /**< \brief [5:5] Sampled Hall Pattern Bits - CCPOS6${x} (rh) */
    Ifx_UReg_32Bit CC63ST:1;          /**< \brief [6:6] Capture/Compare State Bit for CC63 - CC63ST (rh) */
    Ifx_UReg_32Bit reserved_7:1;      /**< \brief [7:7] \internal Reserved */
    Ifx_UReg_32Bit CC6PS0:1;          /**< \brief [8:8] Passive State Select for Compare Outputs CC6${x} (x = 0, 1, 2) - CC6${x}PS (rwh) */
    Ifx_UReg_32Bit COUT6PS0:1;        /**< \brief [9:9] Passive State Select for Compare Outputs COUT6${x} (x = 0, 1, 2) - COUT6${x}PS (rwh) */
    Ifx_UReg_32Bit CC6PS1:1;          /**< \brief [10:10] Passive State Select for Compare Outputs CC6${x} (x = 0, 1, 2) - CC6${x}PS (rwh) */
    Ifx_UReg_32Bit COUT6PS1:1;        /**< \brief [11:11] Passive State Select for Compare Outputs COUT6${x} (x = 0, 1, 2) - COUT6${x}PS (rwh) */
    Ifx_UReg_32Bit CC6PS2:1;          /**< \brief [12:12] Passive State Select for Compare Outputs CC6${x} (x = 0, 1, 2) - CC6${x}PS (rwh) */
    Ifx_UReg_32Bit COUT6PS2:1;        /**< \brief [13:13] Passive State Select for Compare Outputs COUT6${x} (x = 0, 1, 2) - COUT6${x}PS (rwh) */
    Ifx_UReg_32Bit COUT63PS:1;        /**< \brief [14:14] Passive State Select for Compare Output COUT63 - COUT63PS (rwh) */
    Ifx_UReg_32Bit T13IM:1;           /**< \brief [15:15] T13 Inverted Modulation - T13IM (rwh) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_CCU6_CMPSTAT_Bits;

/** \brief Module Identification Register */
typedef struct _Ifx_CCU6_ID_Bits
{
    Ifx_UReg_32Bit MODREV:8;          /**< \brief [7:0] Module Revision Number - MODREV (r) */
    Ifx_UReg_32Bit MODNUM:8;          /**< \brief [15:8] Module Number Value - MODNUM (r) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_CCU6_ID_Bits;

/** \brief Interrupt Enable Register */
typedef struct _Ifx_CCU6_IEN_Bits
{
    Ifx_UReg_32Bit ENCC60R:1;         /**< \brief [0:0] Capture, Compare-Match Rising Edge Interrupt Enable for Channel CC6x - ENCC60R,ENCC61R,ENCC62R (rw) */
    Ifx_UReg_32Bit ENCC60F:1;         /**< \brief [1:1] Capture, Compare-Match Falling Edge Interrupt Enable for Channel CC6x - ENCC60F,ENCC61F,ENCC62F (rw) */
    Ifx_UReg_32Bit ENCC61R:1;         /**< \brief [2:2] Capture, Compare-Match Rising Edge Interrupt Enable for Channel CC6x - ENCC60R,ENCC61R,ENCC62R (rw) */
    Ifx_UReg_32Bit ENCC61F:1;         /**< \brief [3:3] Capture, Compare-Match Falling Edge Interrupt Enable for Channel CC6x - ENCC60F,ENCC61F,ENCC62F (rw) */
    Ifx_UReg_32Bit ENCC62R:1;         /**< \brief [4:4] Capture, Compare-Match Rising Edge Interrupt Enable for Channel CC6x - ENCC60R,ENCC61R,ENCC62R (rw) */
    Ifx_UReg_32Bit ENCC62F:1;         /**< \brief [5:5] Capture, Compare-Match Falling Edge Interrupt Enable for Channel CC6x - ENCC60F,ENCC61F,ENCC62F (rw) */
    Ifx_UReg_32Bit ENT12OM:1;         /**< \brief [6:6] Enable Interrupt for T12 One-Match - ENT12OM (rw) */
    Ifx_UReg_32Bit ENT12PM:1;         /**< \brief [7:7] Enable Interrupt for T12 Period-Match - ENT12PM (rw) */
    Ifx_UReg_32Bit ENT13CM:1;         /**< \brief [8:8] Enable Interrupt for T13 Compare-Match - ENT13CM (rw) */
    Ifx_UReg_32Bit ENT13PM:1;         /**< \brief [9:9] Enable Interrupt for T13 Period-Match - ENT13PM (rw) */
    Ifx_UReg_32Bit ENTRPF:1;          /**< \brief [10:10] Enable Interrupt for Trap Flag - ENTRPF (rw) */
    Ifx_UReg_32Bit reserved_11:1;     /**< \brief [11:11] \internal Reserved */
    Ifx_UReg_32Bit ENCHE:1;           /**< \brief [12:12] Enable Interrupt for Correct Hall Event - ENCHE (rw) */
    Ifx_UReg_32Bit ENWHE:1;           /**< \brief [13:13] Enable Interrupt for Wrong Hall Event - ENWHE (rw) */
    Ifx_UReg_32Bit ENIDLE:1;          /**< \brief [14:14] Enable Idle - ENIDLE (rw) */
    Ifx_UReg_32Bit ENSTR:1;           /**< \brief [15:15] Enable Multi-Channel Mode Shadow Transfer Interrupt - ENSTR (rw) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_CCU6_IEN_Bits;

/** \brief Input Monitoring Register */
typedef struct _Ifx_CCU6_IMON_Bits
{
    Ifx_UReg_32Bit LBE:1;             /**< \brief [0:0] Lost Bit Event - LBE (rwh) */
    Ifx_UReg_32Bit CCPOSI0:1;         /**< \brief [1:1] Event indication for input signal CCPOS${x} - CCPOS${x}I (rwh) */
    Ifx_UReg_32Bit CCPOSI1:1;         /**< \brief [2:2] Event indication for input signal CCPOS${x} - CCPOS${x}I (rwh) */
    Ifx_UReg_32Bit CCPOSI2:1;         /**< \brief [3:3] Event indication for input signal CCPOS${x} - CCPOS${x}I (rwh) */
    Ifx_UReg_32Bit CC6INI0:1;         /**< \brief [4:4] Event indication for input signal CC6${x}IN - CC6${x}INI (rwh) */
    Ifx_UReg_32Bit CC6INI1:1;         /**< \brief [5:5] Event indication for input signal CC6${x}IN - CC6${x}INI (rwh) */
    Ifx_UReg_32Bit CC6INI2:1;         /**< \brief [6:6] Event indication for input signal CC6${x}IN - CC6${x}INI (rwh) */
    Ifx_UReg_32Bit CTRAPI:1;          /**< \brief [7:7] Event indication for input signal CTRAP - CTRAPI (rwh) */
    Ifx_UReg_32Bit T12HRI:1;          /**< \brief [8:8] Event indication for input signal T12HR - T12HRI (rwh) */
    Ifx_UReg_32Bit T13HRI:1;          /**< \brief [9:9] Event indication for input signal T13HR - T13HRI (rwh) */
    Ifx_UReg_32Bit reserved_10:22;    /**< \brief [31:10] \internal Reserved */
} Ifx_CCU6_IMON_Bits;

